bowling/app/controllers/frame_scores_controller.rb

  def result
    # Params should be {"result": {"game": 1, "player": 2, "frame": 3, "roll": 1, "pins": 5}}
    roll_result = params.require(:result).permit(:game, :player, :frame, :roll, :pins)
    # Validation start
    errors = Array.new
    game_player = GamePlayer.where("game_id = ? AND player_id = ?", roll_result[:game], roll_result[:player]).first
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "game_players".* FROM "game_players" WHERE (game_id = 7 AND player_id = 1) ORDER BY "game_players"."id" ASC LIMIT ?  [["LIMIT", 1]]

      end
      # For Frame > 10, check previous Frames has rolls to add > 0
      if roll_result[:frame] > 10
        sum_rolls_to_add = FrameScore.where("game_player_id = ? AND frame_number < ? and rolls_to_add > 0",
	        game_player.id, roll_result[:frame]).sum(:rolls_to_add)
---
SELECT SUM("frame_scores"."rolls_to_add") FROM "frame_scores" WHERE (game_player_id = 1 AND frame_number < 11 and rolls_to_add > 0)
SELECT  "frame_scores".* FROM "frame_scores" WHERE (game_player_id = 1 AND frame_number = 1) ORDER BY "frame_scores"."id" ASC LIMIT ?  [["LIMIT", 1]]

        end
      end
      # Get FrameScore (unique by game_player and frame no)
      @frame_score = FrameScore.where("game_player_id = ? AND frame_number = ?", game_player.id, roll_result[:frame]).first
---
SELECT  "frame_scores".* FROM "frame_scores" WHERE (game_player_id = 1 AND frame_number = 1) ORDER BY "frame_scores"."id" ASC LIMIT ?  [["LIMIT", 1]]

      end
      if roll_result[:roll] == 2
	      if @frame_score.nil?
          errors.push("Frame Score for this frame not found for roll 2")
---
INSERT INTO "frame_scores" ("game_player_id", "frame_number", "roll_one_score", "frame_result", "frame_score", "created_at", "updated_at", "rolls_to_add") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "frame_scores" SET "frame_score" = ?, "rolls_to_add" = ?, "updated_at" = ? WHERE "frame_scores"."id" = ?  [["frame_score", 20], ["rolls_to_add", 1], ["updated_at", "2019-07-25 03:42:42.233227"], ["id", 1]]


    if roll_result[:roll] == 1
       # Create when first roll
       @frame_score = FrameScore.create({game_player: game_player, frame_number: roll_result[:frame], roll_one_score: roll_result[:pins], rolls_to_add: rolls_to_add, frame_result: frame_result, frame_score: roll_score})
---
INSERT INTO "frame_scores" ("game_player_id", "frame_number", "roll_one_score", "frame_result", "frame_score", "created_at", "updated_at", "rolls_to_add") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	      frame_result = '/'
	      rolls_to_add = 1
       end
      @frame_score.update(roll_two_score: roll_result[:pins], rolls_to_add: rolls_to_add, frame_result: frame_result, frame_score: @frame_score.frame_score + roll_score)
    end
    # Reread previous frames to increment their scores for strikes and spares
    FrameScore.where("game_player_id = ? AND frame_number < ? and rolls_to_add > 0",  game_player.id,
      roll_result[:frame]).order(:frame_number).each do |fs|
        fs.update(frame_score: fs.frame_score + roll_result[:pins], rolls_to_add: fs.rolls_to_add - 1)
---
UPDATE "frame_scores" SET "frame_score" = ?, "rolls_to_add" = ?, "updated_at" = ? WHERE "frame_scores"."id" = ?  [["frame_score", 20], ["rolls_to_add", 1], ["updated_at", "2019-07-25 03:42:42.233227"], ["id", 1]]
SELECT "frame_scores".* FROM "frame_scores" WHERE (game_player_id = 1 AND frame_number < 1 and rolls_to_add > 0) ORDER BY "frame_scores"."frame_number" ASC
UPDATE "frame_scores" SET "frame_score" = ?, "rolls_to_add" = ?, "updated_at" = ? WHERE "frame_scores"."id" = ?  [["frame_score", 20], ["rolls_to_add", 1], ["updated_at", "2019-07-25 17:03:55.128848"], ["id", 1]]

    end

    # Update cumulative score for player in this game
    game_player.update(current_frame: roll_result[:frame], game_status: game_status,
      cumulative_score: game_player.cumulative_score + cum_pins)
---
UPDATE "game_players" SET "current_frame" = ?, "cumulative_score" = ?, "updated_at" = ? WHERE "game_players"."id" = ?  [["current_frame", 1], ["cumulative_score", 10], ["updated_at", "2019-07-25 17:03:16.068338"], ["id", 1]]