bowling/app/controllers/games_controller.rb

INSERT INTO "games" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Friday Night Challenge"], ["created_at", "2019-07-24 20:29:24.427484"], ["updated_at", "2019-07-24 20:29:24.427484"]]
---
  def create
    @game = Game.new(game_params)

    if @game.save

INSERT INTO "game_players" ("game_id", "player_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["game_id", 7], ["player_id", 1], ["created_at", "2019-07-25 01:48:04.553920"], ["updated_at", "2019-07-25 01:48:04.553920"]]
INSERT INTO "players" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Tom"], ["created_at", "2019-07-24 21:17:04.776876"], ["updated_at", "2019-07-24 21:17:04.776876"]]
INSERT INTO "games" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Sat Night"], ["created_at", "2019-07-25 21:15:30.407889"], ["updated_at", "2019-07-25 21:15:30.407889"]]
SELECT  "players".* FROM "players" WHERE "players"."name" = ? LIMIT ?  [["name", "Tom"], ["LIMIT", 1]]
INSERT INTO "players" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Tom"], ["created_at", "2019-07-25 21:15:30.451080"], ["updated_at", "2019-07-25 21:15:30.451080"]]
INSERT INTO "game_players" ("game_id", "player_id", "current_frame", "game_status", "cumulative_score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["game_id", 8], ["player_id", 4], ["current_frame", 0], ["game_status", "O"], ["cumulative_score", 0], ["created_at", "2019-07-25 16:52:59.314146"], ["updated_at", "2019-07-25 16:52:59.314146"]]
---
  def start
    newGame = params.require(:game).permit(:description, players: [])
    # Validation start
    errors = Array.new # Hold error messages
    # Check number of players
    if newGame[:players].length < 2 or newGame[:players].length > 8
      errors.push("Number of players must be 2 to 8")
    end

    # Validation end
    if errors.length > 0
      render json: errors, status: unprocessable_entity and return
    end

    @game = Game.create({:description => newGame[:description]})
    @gamePlayers = Array.new
    newGame[:players].each { |p|
      player = Player.find_by_name(p)
      if not player
        # Create new player when not found
        player = Player.create({:name => p})
      end
      # Create GamePlayer with game status Open and Cumulative Score 0
      gamePlayer = GamePlayer.create({"game_id" => @game.id, "player_id" => player.id,
        "current_frame" => 0, "game_status" => 'O', "cumulative_score" => 0})

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "game_players".* FROM "game_players" WHERE (game_id = '1') ORDER BY cumulative_score DESC LIMIT ?  [["LIMIT", 1]]
---
  def getwinner
    @game = Game.find(params[:game])
    if @game.nil?
      render json: "Game #{params[:game]} not found", status: notfound and return
    end
    # Find the winner (or the leading player so far)
    winner = GamePlayer.where("game_id = ?", params[:game]).order("cumulative_score DESC"). first