bowling/app/controllers/game_players_controller.rb

  def getresult
    @game_player = GamePlayer.where("game_id = ? and player_id = ?", params[:game], params[:player]).first
---
SELECT  "game_players".* FROM "game_players" WHERE (game_id = '1' and player_id = '1') ORDER BY "game_players"."id" ASC LIMIT ?  [["LIMIT", 1]]